In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\python311\lib\site-packages (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\python311\lib\site-packages (from pandas) (1.25.0)
Requirement already satisfied: six>=1.5 in c:\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
# Dependencies and Setup
import pandas as pd

In [3]:
# File to Load 
data_df = pd.read_csv("resources1\storedata.csv",sep=';')

C:\Users\Sandeepan Kundu\AppData\Local\Temp\ipykernel_22732\2237121939.py:2: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  data_df = pd.read_csv("resources1\storedata.csv",sep=';')

In [4]:
#check dataframe
data_df.head(10)

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,01.12.2010 08:26,"2,55",17850.0,United Kingdom
1,536365,WHITE METAL LANTERN,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom
2,536365,CREAM CUPID HEARTS COAT HANGER,8,01.12.2010 08:26,"2,75",17850.0,United Kingdom
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom
5,536365,SET 7 BABUSHKA NESTING BOXES,2,01.12.2010 08:26,"7,65",17850.0,United Kingdom
6,536365,GLASS STAR FROSTED T-LIGHT HOLDER,6,01.12.2010 08:26,"4,25",17850.0,United Kingdom
7,536366,HAND WARMER UNION JACK,6,01.12.2010 08:28,"1,85",17850.0,United Kingdom
8,536366,HAND WARMER RED POLKA DOT,6,01.12.2010 08:28,"1,85",17850.0,United Kingdom
9,536367,ASSORTED COLOUR BIRD ORNAMENT,32,01.12.2010 08:34,"1,69",13047.0,United Kingdom

In [5]:
# View Summary statisctics
print (data_df.describe())

            Quantity     CustomerID
count  522064.000000  388023.000000
mean       10.090435   15316.931710
std       161.110525    1721.846964
min     -9600.000000   12346.000000
25%         1.000000   13950.000000
50%         3.000000   15265.000000
75%        10.000000   16837.000000
max     80995.000000   18287.000000

In [6]:
# List of column names
print(data_df.columns)

Index(['BillNo', 'Itemname', 'Quantity', 'Date', 'Price', 'CustomerID',
       'Country'],
      dtype='object')

In [7]:
# To count total rows 
print(data_df.shape)

(522064, 7)

In [8]:
# To find the types of data 
print (data_df.dtypes)

BillNo         object
Itemname       object
Quantity        int64
Date           object
Price          object
CustomerID    float64
Country        object
dtype: object

In [9]:
# To find out the types of all columns in the dataframe
print(data_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 522064 entries, 0 to 522063
Data columns (total 7 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   BillNo      522064 non-null  object
 1   Itemname    520609 non-null  object
 2   Quantity    522064 non-null  int64
 3   Date        522064 non-null  object
 4   Price       522064 non-null  object
 5   CustomerID  388023 non-null  float64
 6   Country     522064 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 27.9+ MB
None

In [10]:
# To count missing values in each column
print(data_df.isnull().sum())

BillNo             0
Itemname        1455
Quantity           0
Date               0
Price              0
CustomerID    134041
Country            0
dtype: int64

In [11]:
# To drop missing values 
data_df=data_df.drop_duplicates()

In [12]:
# To count missing values in each column
print(data_df.isnull().sum())

BillNo             0
Itemname        1455
Quantity           0
Date               0
Price              0
CustomerID    133967
Country            0
dtype: int64

In [13]:
# To Drop data with negative or zero quantity
data_df=data_df.loc[data_df['Quantity']>0]

In [14]:
# To count missing values in each column
print(data_df.isnull().sum())

BillNo             0
Itemname         592
Quantity           0
Date               0
Price              0
CustomerID    132631
Country            0
dtype: int64

In [15]:
# to Drop data with zero price
data_df=data_df.loc[data_df['Price']>'0']

In [16]:
# To count missing values in each column
print(data_df.isnull().sum())

BillNo             0
Itemname           0
Quantity           0
Date               0
Price              0
CustomerID    131497
Country            0
dtype: int64

In [17]:
#Filling null data
data_df=data_df.fillna('-')

In [18]:
# To count missing values in each column
print(data_df.isnull().sum())

BillNo        0
Itemname      0
Quantity      0
Date          0
Price         0
CustomerID    0
Country       0
dtype: int64

In [19]:
# Splitting data into year and month
data_df['Year']=data_df['Date'].apply(lambda x:x.split('.')[2])
data_df['Year']=data_df['Year'].apply(lambda x:x.split(' ')[0])
data_df['Month']=data_df['Date'].apply(lambda x:x.split('.')[1])
data_df.head()

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country,Year,Month
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,01.12.2010 08:26,"2,55",17850.0,United Kingdom,2010,12
1,536365,WHITE METAL LANTERN,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12
2,536365,CREAM CUPID HEARTS COAT HANGER,8,01.12.2010 08:26,"2,75",17850.0,United Kingdom,2010,12
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,01.12.2010 08:26,"3,39",17850.0,United Kingdom,2010,12

In [20]:
# Creating a 'Total price' column
data_df['Price']=data_df['Price'].str.replace(',','.').astype('float64')
data_df['Total_price']=data_df.Quantity*data_df.Price
data_df.head()

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country,Year,Month,Total_price
0,536365,WHITE HANGING HEART T-LIGHT HOLDER,6,01.12.2010 08:26,2.55,17850.0,United Kingdom,2010,12,15.30
1,536365,WHITE METAL LANTERN,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34
2,536365,CREAM CUPID HEARTS COAT HANGER,8,01.12.2010 08:26,2.75,17850.0,United Kingdom,2010,12,22.00
3,536365,KNITTED UNION FLAG HOT WATER BOTTLE,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34
4,536365,RED WOOLLY HOTTIE WHITE HEART.,6,01.12.2010 08:26,3.39,17850.0,United Kingdom,2010,12,20.34

In [21]:
# Checking the total price in each month
data_df.groupby(['Year','Month'])['Total_price'].sum()

Year  Month
2010  12        807215.780
2011  01        665727.010
      02        503060.520
      03        679471.260
      04        527214.751
      05        749008.990
      06        727311.200
      07        669497.001
      08        732944.090
      09       1006294.612
      10       1115378.190
      11       1465421.650
      12        628846.920
Name: Total_price, dtype: float64

In [22]:
# droping 2010 data
data_df=data_df.loc[data_df['Year']!='2010']

In [23]:
# Checking the total price in each month
data_df.groupby(['Year','Month'])['Total_price'].sum()

Year  Month
2011  01        665727.010
      02        503060.520
      03        679471.260
      04        527214.751
      05        749008.990
      06        727311.200
      07        669497.001
      08        732944.090
      09       1006294.612
      10       1115378.190
      11       1465421.650
      12        628846.920
Name: Total_price, dtype: float64

In [24]:
# Save DataFrame to a new CSV file
data_df.to_csv('Resources1\cleaneddata.csv', index=False)

In [25]:
pip install matplotlib

Requirement already satisfied: matplotlib in c:\python311\lib\site-packages (3.7.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\python311\lib\site-packages (from matplotlib) (1.1.0)
Requirement already satisfied: cycler>=0.10 in c:\python311\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\python311\lib\site-packages (from matplotlib) (4.40.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\python311\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: numpy>=1.20 in c:\python311\lib\site-packages (from matplotlib) (1.25.0)
Requirement already satisfied: packaging>=20.0 in c:\python311\lib\site-packages (from matplotlib) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\python311\lib\site-packages (from matplotlib) (9.5.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\python311\lib\site-packages (from matplotlib) (3.1.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\python311\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\python311\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [26]:
# File to Load 
data_df = pd.read_csv("Resources1\cleaneddata.csv")
data_df.head(10)

C:\Users\Sandeepan Kundu\AppData\Local\Temp\ipykernel_22732\3089816536.py:2: DtypeWarning: Columns (0) have mixed types. Specify dtype option on import or set low_memory=False.
  data_df = pd.read_csv("Resources1\cleaneddata.csv")

,BillNo,Itemname,Quantity,Date,Price,CustomerID,Country,Year,Month,Total_price
0,539993,JUMBO BAG PINK POLKADOT,10,04.01.2011 10:00,1.95,13313.0,United Kingdom,2011,1,19.5
1,539993,BLUE POLKADOT WRAP,25,04.01.2011 10:00,0.42,13313.0,United Kingdom,2011,1,10.5
2,539993,RED RETROSPOT WRAP,25,04.01.2011 10:00,0.42,13313.0,United Kingdom,2011,1,10.5
3,539993,RECYCLING BAG RETROSPOT,5,04.01.2011 10:00,2.10,13313.0,United Kingdom,2011,1,10.5
4,539993,RED RETROSPOT SHOPPER BAG,10,04.01.2011 10:00,1.25,13313.0,United Kingdom,2011,1,12.5
5,539993,JUMBO BAG RED RETROSPOT,10,04.01.2011 10:00,1.95,13313.0,United Kingdom,2011,1,19.5
6,539993,RED RETROSPOT CHILDRENS UMBRELLA,6,04.01.2011 10:00,3.25,13313.0,United Kingdom,2011,1,19.5
7,539993,JAM MAKING SET PRINTED,12,04.01.2011 10:00,1.45,13313.0,United Kingdom,2011,1,17.4
8,539993,RECIPE BOX RETROSPOT,6,04.01.2011 10:00,2.95,13313.0,United Kingdom,2011,1,17.7
9,539993,CHILDRENS APRON APPLES DESIGN,8,04.01.2011 10:00,1.95,13313.0,United Kingdom,2011,1,15.6

In [27]:
# Import dependencies.
import matplotlib.pyplot as plt

In [28]:
#data_df.plot(x="Month", y="Quantity",kind="bar")
#plt.show()

In [29]:
pip install numpy

Requirement already satisfied: numpy in c:\python311\lib\site-packages (1.25.0)
Note: you may need to restart the kernel to use updated packages.

In [30]:
# Import dependencies.
%matplotlib inline

import matplotlib
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
data_df.plot(x="Month",y=["Total_price","Quantity"],kind="bar")
plt.show()